[ViperPrince1 X2CharacterTemplate]
strCharacterName="Viper Prince Broken Tusk"

[ViperPrince2 X2CharacterTemplate]
strCharacterName="Viper Prince Chromedome"

[ViperPrince3 X2CharacterTemplate]
strCharacterName="Viper Prince Mohawk"

[ViperPrincess X2CharacterTemplate]
strCharacterName="Viper Princess Sissssster"

[ViperHatchlingS X2CharacterTemplate]
strCharacterName="Viper Hatchling"

[ViperHatchlingC X2CharacterTemplate]
strCharacterName="Viper Hatchling"

[ViperHatchlingT X2CharacterTemplate]
strCharacterName="Viper Hatchling"

[ViperHatchling X2CharacterTemplate]
strCharacterName="Viper Hatchling"

[ViperFrostling X2CharacterTemplate]
strCharacterName="Viper Frostling"

[ViperPrince1_WPN X2WeaponTemplate]
FriendlyName="Royal Viper Sniper Caster"

[ViperPrince2_WPN X2WeaponTemplate]
FriendlyName="Royal Viper Bow Caster"

[ViperFrostAxe X2WeaponTemplate]
FriendlyName="Royal Frost Axe"

[FrostScaleVest X2GrenadeTemplate]
FriendlyName="<font color='#13B0E1'>Frost Scale Vest</font>"
FriendlyNamePlural="<font color='#13B0E1'>Frost Scale Vests</font>"
BriefSummary="The Frost Scale Vest is made from the Frost Viper's Scales and grants immunities to Viper Poison as well as Frost."
TacticalText="<bullet/> Increases soldier health by 2.\n<bullet/> Provides immunity to poison and frost. This vest needs to be equipped in a grenade slot for the Snap Freeze ability to work as intended."

[XCOMFrostCaster X2WeaponTemplate]
FriendlyName ="<font color='#13B0E1'>Frost Caster Sniper Rifle</font>"
FriendlyNamePlural="<font color='#13B0E1'>Frost Caster Sniper Rifles</font>"
TacticalText= "<bullet/> Frost Caster Sniper Rifle.\n<bullet/> Has a 3 shot capacity.\n<bullet/> Grants Banish, Frostbite Shot and +15 Aim."
BriefSummary= "The Frost Caster Sniper Rifle has the same damage output and added +15 Aim as a tier 3 Beam Caster. It also grants the Banish Ability and a Frostbite Shot Ability."

[XCOMFrostAxe X2WeaponTemplate]
FriendlyName="<font color='#13B0E1'>Frost Axe</font>"
FriendlyNamePlural="<font color='#13B0E1'>Frost Axes</font>"
BriefSummary="The Frost Axe has a damage output similar to the tier 3 Hunter Beam Axe. It also grants a special Frost Slash ability that if hit by, will do base damage as well as freeze the target in place."
TacticalText="<bullet/> Can be used to slash and or Frost Slash.\n<bullet/> Frost Slash has a 4 turn cooldown."
AbilityDescName="axe"

[Frostbomb X2TechTemplate]
DisplayName="<font color='#13B0E1'>Frost Bomb</font>"
Summary="Relying on an as-of-yet unidentified chemical agent, these hand-held explosives seem capable of instantaneously reducing the ambient temperature of the surrounding area. Exposed tissue will be frozen on contact. This weapon is unique, and cannot be duplicated or replaced."

[Frostbomb X2GrenadeTemplate]
FriendlyName="<font color='#13B0E1'>Frost Bomb</font>"
FriendlyNamePlural="<font color='#13B0E1'>Frost Bombs</font>"
BriefSummary="Relying on an as-of-yet unidentified chemical agent, these hand-held explosives seem capable of instantaneously reducing the ambient temperature of the surrounding area. Exposed tissue will be frozen on contact. This weapon is unique, and cannot be duplicated or replaced."
TacticalText="<Bullet/> Frost bombs freeze all units in the blast radius, preventing them from taking any actions for one turn.\n<Bullet/> Frost bombs have a smaller radius than standard frag grenades."
ThrownAbilityName="Throw Frost Bomb"
ThrownAbilityHelpText="Freeze all units in the target area."
LaunchedAbilityname="Launch Frost Bomb"
LaunchedAbilityHelpText="Freeze all units in the target area."

[FrostAxeSlash X2AbilityTemplate]
LocFriendlyName="Frost Slash"
LocLongDescription="Slash an enemy dealing base damage plus freezing them in place."
LocHelpText="Frost Slash."
LocFlyOverText="Frost Slash"

[FrostBiteShot X2AbilityTemplate]
LocFriendlyName="Frostbite Shot"
LocLongDescription="Shoot an enemy dealing Frostbite damage and freezing them in place."
LocHelpText="Frostbite Shot."
LocFlyOverText="Frostbite Shot"

[FrostBlood X2AbilityTemplate]
LocFriendlyName="Snap Freeze"
LocLongDescription="When certain Vipers are killed they will explode dealing Frost damage to the area."
LocHelpText="When certain Vipers are killed they will explode dealing Frost damage to the area."
LocFlyOverText="Snap Freeze"

[ViperChildrenInitialState X2AbilityTemplate]
LocFriendlyName="3 Actions"
LocLongDescription="Unlike the Viper King who can take actions or reactions with most of XCom's actions, his Children can not. However they can take up to 3 actions in a single combat round."
LocHelpText="Take 3 actions."
LocFlyOverText="3 actions"

[ViperHatchlingMolt X2AbilityTemplate]
LocFriendlyName="Hatchling Molt"
LocLongDescription="These new Hatchings have a high regeneration rate and can Molt to regen 2 HP a turn if wounds are taken."
LocHelpText="Molt and heal 2 HP a turn."
LocFlyOverText="Hatchling Molt"

[MultiActions X2AbilityTemplate]
LocFriendlyName="Multi Actions"
LocLongDescription="The Viper Children can take 3 actions a turn."
LocHelpText="Take 3 actions a turn."


[LiquidNitroExplosion X2AbilityTemplate]
LocFriendlyName="Snap Freeze"
LocLongDescription="Snap Freeze can be used in a 4 tile radius around the vest wearer. Explodes dealing Frost damage to the area. Wearer is immune."
LocHelpText="Liquid Nitrogen frost explosion to area."
LocFlyOverText="Snap Freeze"

[CorpseViperPrinceChromedome X2ItemTemplate]
FriendlyName="<font color='#13B0E1'>Viper Prince Chromedome's Corpse</font>"
FriendlyNamePlural="<font color='#13B0E1'>Viper Prince Chromedome's Corpse</font>"
BriefSummary="Would seem that the Viper King has been busy. These new Princes are not as strong but just as deadly. Chromedome was the first of his brood to hatch. It may have only been by a few seconds but that meant he was the oldest. Maybe not the Smartest, but he took the most after his father. Most of the others from his brood looked up to their older brother and those that did not were eaten by him."

[CorpseViperPrinceMohawk X2ItemTemplate]
FriendlyName="<font color='#13B0E1'>Viper Prince Mohawk's Corpse</font>"
FriendlyNamePlural="<font color='#13B0E1'>Viper Prince Mohawk's Corpse</font>"
BriefSummary="Would seem that the Viper King has been busy. Mohawk and his twin Broken Tusk, were born together from a single egg. These two have alwasy had a sibling rivalry, a real love hate relationship. Even though they hate each other, they hate their other siblings more. If not for protecting each other, their older brother Chromedome might have eaten them both already.  Mohawk is missing an eye. It was lost at birth when his twin stuck a tusk in his eye as the two pushed to be first out of their ever so cramped egg."

[CorpseViperPrinceBrokenTusk X2ItemTemplate]
FriendlyName="<font color='#13B0E1'>Viper Prince Broken Tusk's Corpse</font>"
FriendlyNamePlural="<font color='#13B0E1'>Viper Prince Broken Tusk's Corpse</font>"
BriefSummary="Would seem that the Viper King has been busy. Like his Twin, Broken Tusk hatched from the same egg. The two hate each other with a passion but hate the rest of their siblings even more. The brothers are constantly fighting but will fiercely protect each other if one of the two should be threatened by anything else. Broken Tusk is called so because his now broken tusk is lodged in his brother's eye socket. It was broken off as the two fought to be the first to break out of their single egg."

[CorpseViperPrincess X2ItemTemplate]
FriendlyName="<font color='#13B0E1'>Viper Princess Sisssster's Corpse</font>"
FriendlyNamePlural="<font color='#13B0E1'>Viper Princess Sisssster's Corpse</font>"
BriefSummary="This Princess is the first true female offspring from the Viper King. She's not as strong but just as deadly as her Father. There is no telling how many offspring of his may be out there. The Princess goes by the name Sissssster, given to her by her twin brothers Mohawk and Broken Tusk. She was the last to hatch of twenty five siblings. Most of them did not live long as the oldest brother Chromedome ate those weaker than him. Only those that could protect each other like the twin brothers or Sissssster herself, lived to grow older. Sissssster was strongest and smartest of her brothers but did not care to fight any of them to prove it. She knew one day she would take her father's spot and become Queen of all Vipers."

[AutopsyViperPrinceChromedome X2TechTemplate]
DisplayName="<font color='#13B0E1'>Viper Prince Chromedome Autopsy</font>"
Summary="Chromedome was the oldest Viper Prince of many out there. These Offspring are just as smart as their Father and in most cases much more deadly."
CodeName="Hard Head"
LongDescription="Would seem that the Viper King has been busy. These new Princes are not as strong but just as deadly. Chromedome was the first of his brood to hatch. It may have only been by a few seconds but that meant he was the oldest. Maybe not the Smartest, but he took the most after his father. Most of the others from his brood looked up to their older brother and those that did not were eaten by him. R. Tygan."
AlertString="Chromedome"

[AutopsyViperPrinceMohawk X2TechTemplate]
DisplayName="<font color='#13B0E1'>Viper Prince Mohawk Autopsy</font>"
Summary="Mohawk was one of two Viper Prince twins. These Offspring are just as smart as their Father and in most cases much more deadly."
CodeName="One Eye"
LongDescription="Would seem that the Viper King has been busy. Mohawk and his twin Broken Tusk, were born together from a single egg. These two have alwasy had a sibling rivalry, a real love hate relationship. Even though they hate each other, they hate their other siblings more. If not for protecting each other, their older brother Chromedome might have eaten them both already.  Mohawk is missing an eye. It was lost at birth when his twin stuck a tusk in his eye as the two pushed to be first out of their ever so cramped egg. R. Tygan."
AlertString="Mohawk"

[AutopsyViperPrinceBrokenTusk X2TechTemplate]
DisplayName="<font color='#13B0E1'>Viper Prince Broken Tusk Autopsy</font>"
Summary="Broken Tusk was one of two Viper Prince twins. These Offspring are just as smart as their Father and in most cases much more deadly."
CodeName="Toothless"
LongDescription="Would seem that the Viper King has been busy. Like his Twin, Broken Tusk hatched from the same egg. The two hate each other with a passion but hate the rest of their siblings even more. The brothers are constantly fighting but will fiercely protect each other if one of the two should be threatened by anything else. Broken Tusk is called so because his now broken tusk is lodged in his brother's eye socket. It was broken off as the two fought to be the first to break out of their single egg. R. Tygan."
AlertString="Broken Tusk"

[AutopsyViperPrincess X2TechTemplate]
DisplayName="<font color='#13B0E1'>Viper Princess Sissssster Autopsy</font>"
Summary="Sissssster was youngest of her siblings and the most feared. These Offspring are just as smart as their Father and in most cases much more deadly."
CodeName="Snow White"
LongDescription="This Princess is the first true female offspring from the Viper King. She's not as strong but just as deadly as her Father. There is no telling how many offspring of his may be out there. The Princess goes by the name Sissssster, given to her by her twin brothers Mohawk and Broken Tusk. She was the last to hatch of twenty five siblings. Most of them did not live long as the oldest brother Chromedome ate those weaker than him. Only those that could protect each other like the twin brothers or Sissssster herself, lived to grow older. Sissssster was strongest and smartest of her brothers but did not care to fight any of them to prove it. She knew one day she would take her father's spot and become Queen of all Vipers. R. Tygan."
AlertString="Sissssster"


[ViperportalC X2AbilityTemplate]
LocFriendlyName="Call the Nest"
LocLongDescription="Opens a Viper Portal of which more Vipers will be called in as reinforcements."
LocHelpText="Open Viper Portal."
LocFlyOverText="Send more!"

[ViperportalS X2AbilityTemplate]
LocFriendlyName="Call the Nest"
LocLongDescription="Opens a Viper Portal of which more Vipers will be called in as reinforcements."
LocHelpText="Open Viper Portal."
LocFlyOverText="Your Princess callssssss you!"

[ViperportalT X2AbilityTemplate]
LocFriendlyName="Call the Nest"
LocLongDescription="Opens a Viper Portal of which more Vipers will be called in as reinforcements."
LocHelpText="Open Viper Portal."
LocFlyOverText="We demand more sssssservents!"

[ViperPrincessPortal X2AbilityTemplate]
LocFriendlyName="Call The Princess"
LocLongDescription="Opens a Portal of which the Viper Princess will be called though to join the hunt."
LocHelpText="Open Viper Portal."
LocFlyOverText="Princess HELP!!"

[ViperPrincePortal X2AbilityTemplate]
LocFriendlyName="Call The Prince"
LocLongDescription="Opens a Portal of which a Viper Prince will be called though to join the hunt."
LocHelpText="Open Viper Portal."
LocFlyOverText="Humanssssss.... here!!!"

[ViperTwinsPortal X2AbilityTemplate]
LocFriendlyName="Call The Twin Princes"
LocLongDescription="Opens a Portal of which the a Viper Prince will be called though to join the hunt."
LocHelpText="Open Viper Portal."
LocFlyOverText="We found food!!"

[ViperTwinsPortal2 X2AbilityTemplate]
LocFriendlyName="Call Brother"
LocLongDescription="Opens a Portal of which a Viper Prince will be called though to join the hunt."
LocHelpText="Open Viper Portal."
LocFlyOverText="Join the hunt brother!!"


[DaddysLittlePrincess X2SitRepTemplate]
FriendlyName="<font color='#13B0E1'>Daddy's little girl</font>"
Description="The Viper Princess has tasked A large Viper tracking party to hunt XCom on this mission."

[DaddysLittlePrincessEffect X2SitRepEffect_ModifyDefaultEncounterLists]
FriendlyName="<font color='#13B0E1'>Vipers on the hunt</font>"
Description="Large Viper groups have shown up and are looking to hunt XCom. At the first sign of XCom, a Viper Scout will call in the Viper Princess to join the hunt."

[LikeFatherLikeSon X2SitRepTemplate]
FriendlyName="<font color='#13B0E1'>Like Father like Son</font>"
Description="A Viper Prince has tasked A large Viper tracking party to hunt XCom on this mission."

[LikeFatherLikeSonEffect X2SitRepEffect_ModifyDefaultEncounterLists]
FriendlyName="<font color='#13B0E1'>Vipers on the hunt</font>"
Description="Large Viper groups have shown up and are looking to hunt XCom. At the first sign of XCom, a Viper Scout will call in the Viper Prince to join the hunt."

[TwinTrouble X2SitRepTemplate]
FriendlyName="<font color='#13B0E1'>Twin Trouble</font>"
Description="Twin Viper Princes have tasked A large Viper tracking party to hunt XCom on this mission."

[TwinTroubleEffect X2SitRepEffect_ModifyDefaultEncounterLists]
FriendlyName="<font color='#13B0E1'>Vipers on the Hunt</font>"
Description="Large Viper groups have shown up and are looking to hunt XCom. At the first sign of XCom, a Viper Scout will call in the Twin Viper Princes to join the hunt."

